# Задание 3
# 3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
# В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).
# В классе должны быть реализованы методы перегрузки арифметических операторов: сложение (__add__()),
# вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).Данные методы должны применяться
# только к клеткам и выполнять увеличение, уменьшение, умножение и обычное (не целочисленное) деление клеток,
# соответственно. В методе деления должно осуществляться округление значения до целого числа.
# Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных
# двух клеток.
# Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух
# клеток больше нуля, иначе выводить соответствующее сообщение.
# Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества
# ячеек этих двух клеток.
# Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
# ячеек этих двух клеток.
# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
# Данный метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
# Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
# *****\n*****\n**.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
# *****\n*****\n*****.

class Cell:
    def __init__(self, cells):
        self.cells = cells

    def __add__(self, other):
        return self.cells + other.cells

    def __sub__(self, other):
        res = self.cells - other.cells
        if res >= 0:
            return res
        else:
            print('Разность меньше 0')

    def __mul__(self, other):
        return self.cells * other.cells

    def __truediv__(self, other):
        try:
            return int(self.cells / other.cells)
        except ZeroDivisionError:
            print('Деление на ноль')

    def make_order(self, n):
        (x, y) = divmod(self.cells, n)
        s = ''
        for _ in range(x):
            s += '*' * n + '\\n'
            # s += '*' * n + '\n'
        s += '*' * y
        s = s.rstrip('\\n')
        return s

    def __str__(self):
        return f'Клетка: {self.cells}'


c1 = Cell(10)
c2 = Cell(4)
print(c1)
print(c2)

print(f'Сумма: {c1 + c2}')
print(f'Разность: {c1 - c2}')
print(f'Умножение: {c1 * c2} ')
print(f'Деление: {c1 / c2} ')

c3 = Cell(12)
print(c3.make_order(5))

c4 = Cell(7)
print(c4.make_order(10))
